# ЗАДАНИЕ: ИССЛЕДОВАНИЕ ОЦЕНОК УЧЕНИКОВ
#
# Представьте, что у вас есть таблица из 10 учеников с оценками учеников
# по 5 разным предметам. Вам нужно выполнить несколько шагов, чтобы
# проанализировать эти данные:
#
# 1. Самостоятельно создайте DataFrame с данными
# 2. Выведите первые несколько строк DataFrame, чтобы убедиться, что данные загружены правильно
# 3. Вычислите среднюю оценку по каждому предмету
# 4. Вычислите медианную оценку по каждому предмету
# 5. Вычислите Q1 и Q3 для оценок по математике:
# Q1_math = df['Математика'].quantile(0.25)
# Q3_math = df['Математика'].quantile(0.75)
# 6. можно также попробовать рассчитать IQR
# 7. Вычислите стандартное отклонение

import pandas as pd

data = {
    'Учащийся': ['Иванов Олег', 'Петрова Елена', 'Сидоров Иван', 'Кузнецова Ольга', 'Фомин Сергей', 'Журавлева Светлана', 'Глухов Сергей', 'Фёдорова Виктория', 'Степанов Андрей', 'Ильина Ольга'],
    'Русский язык': [3, 4, 5, 4, 5, 5, 4, 5, 3, 4],
    'Литература': [4, 5, 5, 4, 5, 5, 4, 4, 3, 5],
    'Математика': [4, 5, 4, 3, 5, 5, 5, 5, 5, 5],
    'Физика': [3, 4, 5, 3, 5, 5, 4, 5, 3, 4],
    'Химия': [5, 3, 5, 4, 4, 5, 4, 5, 4, 5]
}

# Создаем датафрейм на основе данных
df = pd.DataFrame(data)

# Установим имя ученика как индекс
df.set_index('Учащийся', inplace=True)

print(f"\n============================================================================")
print(f"                      1. ЖУРНАЛ УСПЕВАЕМОСТИ УЧАЩИХСЯ")
print(f"============================================================================")

print(df)

# Вычисляем Q1, Q3 и IQR для оценок по всем предметам:
Q1_rus = df['Русский язык'].quantile(0.25)
Q3_rus = df['Русский язык'].quantile(0.75)
IQR_rus = Q3_rus - Q1_rus

Q1_lit = df['Литература'].quantile(0.25)
Q3_lit = df['Литература'].quantile(0.75)
IQR_lit = Q3_lit - Q1_lit

Q1_math = df['Математика'].quantile(0.25)
Q3_math = df['Математика'].quantile(0.75)
IQR_math = Q3_math - Q1_math

Q1_fiz = df['Физика'].quantile(0.25)
Q3_fiz = df['Физика'].quantile(0.75)
IQR_fiz = Q3_fiz - Q1_fiz

Q1_xim = df['Химия'].quantile(0.25)
Q3_xim = df['Химия'].quantile(0.75)
IQR_xim = Q3_xim - Q1_xim

# Формируем новый сводный дата-сет по всем предметам
statistika = {
    'Предмет': ['Русский язык', 'Литература', 'Математика', 'Физика', 'Химия'],
    'Средний балл': [df['Русский язык'].mean(), df['Литература'].mean(), df['Математика'].mean(), df['Физика'].mean(), df['Химия'].mean()],
    'Медиана': [df['Русский язык'].median(), df['Литература'].median(), df['Математика'].median(), df['Физика'].median(), df['Химия'].median()],
    'Стандартное отклонение': [df['Русский язык'].std(), df['Литература'].std(), df['Математика'].std(), df['Физика'].std(), df['Химия'].std()],
    'Q1': [Q1_rus, Q1_lit, Q1_math, Q1_fiz, Q1_xim],
    'Q3': [Q3_rus, Q3_lit, Q3_math, Q3_fiz, Q3_xim],
    'IQR': [IQR_rus, IQR_lit, IQR_math, IQR_fiz, IQR_xim],
}

df_statistika = pd.DataFrame(statistika)

# Установим предмет в качестве индекса
df_statistika.set_index('Предмет', inplace=True)

print(f"\n============================================================================")
print(f"            2. СВОДНАЯ СТАТИСТИКА УСПЕВАЕМОСТИ ПО ВСЕМ ПРЕДМЕТАМ")
print(f"============================================================================")
print(df_statistika)
print(f"============================================================================")